
'''Задача 1
Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована.
'''
# for i in range(1,6):
#   print(i,"0" * i)
'''
Задача 2
Пользователь в цикле вводит 10 цифр. Найти количество введеных пользователем цифр 5.
'''
# integer_number = int(input("Введите 10 цифр:"))
# count = 0
# while integer_number>0:
#     if integer_number%10 == 5:
#       count += 1
#     integer_number = integer_number//10
# print("цифра 5 введена",count,"раз")
'''
Задача 3
Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
'''
# sum = 0
#
# for i in range(1,101):
#     sum+=i
# print(sum)

'''
Задача 4
Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.
'''
# mult = 1
# for i in range(0,10,1):
#         mult = mult * (i+1)
# print(mult)

'''
Задача 5
Вывести цифры числа на каждой строчке.
'''

# integer_number = 2129
#
# print(integer_number%10,integer_number//10)
#
# while integer_number>0:
#     print(integer_number%10)
#     integer_number = integer_number//10

'''
Задача 6
Найти сумму цифр числа.
'''
# a = int(input("Введите число:"))
# sum = 0
# while a>0:
#   b = a%10
#   sum += b
#   a = a//10
#
# print("Сумма всех цифр числа = ",sum)
'''
Задача 7
Найти произведение цифр числа.
'''
# a = int(input("Введите число:"))
# mult = 1
# while a>0:
#   b = a%10
#   mult *= b
#   a = a//10
# print("Произведение всех цифр числа = ",mult)
'''
Задача 8
Дать ответ на вопрос: есть ли среди цифр числа 5?
'''
# integer_number = 213413
# while integer_number>0:
#     if integer_number%10 == 5:
#         print('Yes')
#         break
#     integer_number = integer_number//10
# else: print('No')

'''
Задача 9
Найти максимальную цифру в числе
'''


'''
Задача 10
Найти количество цифр 5 в числе
'''